//
//  ContentView.swift
//  MookSiew
//
//  Created by Tyme Suteesopon on 10/2/2566 BE.
//

import SwiftUI

struct ContentView: View {
    @State private var index = 0
    let mooks = ["แดดร้อนที่แยงตา ไม่เท่าเธอยิ้มมาแล้วแยงใจ", "จะเป็นทำไมคนเหงา มาเป็นคนของเราดีกว่า", "ที่ใส่เสื้อรัดๆ เพราะอยากให้เธอรู้ว่าชอบคับ", "ที่บ้านเธอมีแก้วกี่ใบ เราจะได้เทใจให้หมดเลย", "ผมชอบเลขครับ ชอบบวก ชอบลบ ชอบหาร แล้วก็ชอบคูณ", "อาจจะดูไม่เต็มบาท แต่ความรักมีให้ไม่ขาดนะบอกเลย", "กินหมูกระทะจะเจอเนื้อย่าง แต่ถ้าเธอมาอยู่ข้างๆ จะเจอเนื้อคู่นะ", "ที่ไปเที่ยวเพราะอยากพัก ที่เข้าไปทักเพราะอยากคบ", "ขนาดไก่ยังมีเล้า แล้วเธอเล่าไม่อยากมีเราบ้างหรอ", "คนดี คนชั่ว มีอยู่ทั่วไป แต่คนที่ดีกับใจ มีแค่เธอคนเดียวนะ", "มุขเสี่ยวคิดไม่ทัน คิดถึงเธอก่อนแล้วกันมันง่ายดี", "ไม่อยากใช้ของร่วมกับใคร แต่อยากใช้ใจร่วมกับเธอ", "จ้องคอมแล้วตาเบลอ แต่ถ้าจ้องเธอแล้วจะได้เบอร์ป่ะ", "ฝากเงินได้แค่ดอกเบี้ย​ แต่ฝากใจกับเราเนี้ย​ ได้ทั้งบัญชี", "ถึงเราจะไม่ใช่นาฬิกา แต่เราก็มีเวลาให้นะ", "เปิด GPS ก็ไม่ช่วยอะไรเลย เพราะฉันหลงเธอไม่ได้หลงทาง", "กล้องไม่โฟกัส เพราะความชัดมันอยู่ที่เธอ", "ยืนคนเดียวมันเดียวดาย หากได้เธอมายืนข้างกายก็คงดี", "ไม่ต้องมีหรอกลักยิ้ม แค่น้องยิ้มพี่ก็รักแล้ว", "ตรวจเลือดไม่เจออะไร แต่ตรวจหัวใจทำไมเจอเธอ", "ไม่ต้องฟอลโลวไอจี แต่ช่วยฟอลอินเลิฟวิทมีได้มั้ย", "คุยถูกคอ มีทั่วไป แต่คุยแล้วถูกใจ มีแค่เธอ", "แคปหมูอ่ะอร่อย แต่ที่แคปบ่อยๆ อ่ะรูปเธอ", "เป็นคนเรียบร้อยอ่ะเป็นยาก แต่ถ้าเป็นคนที่รักเธอมากเราอ่ะเป็นได้", "อ่านหนังสือ 10 รอบ ไม่เคยจำ เจอหน้าเธอ 1 ครั้ง เราจำไม่เคยลืม", "ถนนดำ เรียกว่าทางราดยาง แล้วมีถนนอะไรบ้าง ที่เรียกว่าทางรักเรา", "น้ำอัดลมทำให้เราชอบเรอ แต่น่ารักแบบเธอ ทำให้เราชอบใจ", "พัดลม เรียกว่า fan หรือจะเรียกเราแทน ก็แฟนเหมือนกัน", "ธนาคารมีไว้ฝากตังค์ เธอมีใครหรือยัง อยากฝากใจ", "ยุงกัดให้ตบ อยากคบให้บอก", "แคปหมูอ่ะอร่อย แต่ที่แคปบ่อย ๆ อ่ะรูปเธอ", "คนดีชอบแก้ไข คนอย่างเราไงชอบแค่เธอ", "ติดศูนย์ยังมีให้แก้ ติดเธอแทบแย่ไม่รู้จะแก้ยังไง", "โคโรน่าอะเป็นไวรัส แต่โคตรน่ารักอะเป็นเธอ", "หน้ากากอะ ต้านไวรัส แต่เธอน่ารักอะ เราต้านไม่ไหว", "มองรูปเราให้ชินก่อนนะ เดี๋ยวตอนนั่งสบตาจะได้ไม่เขิน", "ว่ายน้ำต้องไปที่สระ ไหว้แม่เธอล่ะต้องไปที่ไหน", "กินบะหมี่ให้เลือกเส้น แต่ถ้าอยากมีแฟนขี้เล่นให้เลือกเรา", "เราชอบตัวเองตอนเผลอ แล้วเธอชอบเราตอนไหน", "ถ้าชอบก็บอกกันตรงๆ ไม่ต้องเอาปากกามาวงมันเลอะเทอะ", "ขนมปังคือฟาร์มเฮาส์ แต่สำหรับเรา เธอคือฟามรัก", "แค่เธอบอกว่ารัก ฉันก็พร้อมจะควักตังค์ให้แล้ว", "ทำผิดต้องโดนลงโทษ ถ้าคิดถึงเธอโคตรๆ ต้องโดนอะไร", "น้ำอัดลมทำให้เราชอบเรอ น่ารักแบบเธอ ทำให้เราชอบใจ", "แขนหักให้ไปหาหมอ แต่ถ้าแขนเป็นฟอให้มาหาเรา", "เห็นเธอแล้วเหมือนหลงทาง ต้องทำไงบ้างให้เธอมาหลงเรา", "ตรวจเลือดตรวจสมองไม่เจออะไร แต่พอมาตรวจตรงหัวใจทำไมเจอเธอ", "แสงUVไม่ดีต่อตา แต่ถ้าเธอมองมาคงดีต่อใจ", "มุขเสี่ยว ๆ คิดไม่ทัน คิดถึงเธอก่อนแล้วกันมันง่ายดี", "ถ้าเธอดูแลตัวเองไม่ดี เราจะไปดูแลให้แล้วนะ", "เธอคนเดียวที่กินใจ แม้ใคร ๆ จะกินคลีน", "แดดส่องให้เอามือบัง ถ้าอยากเป็นคนสำคัญให้ยื่นมือมา", "มองพี่บ่อย ๆ อยากได้ไลน์ หรืออยากได้ใจพี่จ้ะ", "มีไลน์ มีใจ มีอะไรก็ทักมาเลย", ]
    
    
    var body: some View {
        ZStack{
            Image("background")
                .resizable()
                .ignoresSafeArea()
            
            
            Image("postit4")
                .resizable()
                .aspectRatio(contentMode: .fit)
                .scaleEffect(0.9)
                .padding(.bottom, 40)
            
            
            VStack {
                Spacer()
                
                Text("\(mooks[index])")
                    .font(.custom("Plump", size: 40))
                    .foregroundColor(.black)
                    .padding([.leading, .trailing,], 60)
                    .padding([.top], 90)
                
                Spacer()
                
                ZStack{
                    HStack {
                        Button(action: {
                            self.index = (self.index + 1) % self.mooks.count
                        }){
                            
                            Image(systemName: "goforward")
                                .font(.largeTitle)
                                .foregroundColor(.black)
                            
                        }
                        .frame(width: 75, height: 75)
                        .background(.white)
                        
                        .clipShape(Circle())
                        .contentShape(.contextMenuPreview, Circle())
                        .frame(maxWidth: .infinity, alignment: .bottomTrailing)
                        .padding()
                        .padding(.trailing)
                        .shadow(color: .black, radius: 3, x: 3, y: 3)
                        
                    }
                }.onLongPressGesture(minimumDuration: 0.1) {
                    let keyWindow = UIApplication.shared.connectedScenes
                        .filter({$0.activationState == .foregroundActive})
                        .map({$0 as? UIWindowScene})
                        .compactMap({$0})
                        .first?.windows
                        .filter({$0.isKeyWindow}).first

                    let activityController = UIActivityViewController(activityItems: [self.mooks[self.index]], applicationActivities: nil)
                    keyWindow?.rootViewController?.present(activityController, animated: true, completion: nil)
                }
                .padding(.bottom, 30)
                
            }
        }
        
        
    }
    
    
    
    struct ContentView_Previews: PreviewProvider {
        static var previews: some View {
            ContentView()
        }
    }
}
